[
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1140,
            "description": "This course is an introduction to the philosophy of mind and cognitive science. Students meet in small sections to have class discussions and debates about questions like: What are minds? Are minds physical or non-physical? Do humans have free will? Does reliance on technology turn humans into cyborgs? How close are humans to building an intelligent robot or machine? Do we want this to be a goal? Students will learn how make a philosophical argument, and how to express them in writing or through an oral presentation.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Minds And Machines",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "info": "03/05/2021 10:10:24",
        "model": "database.course",
        "pk": 4055
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1972,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Ai And Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "info": "03/05/2021 10:10:24",
        "model": "database.course",
        "pk": 4056
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1235,
            "description": "The Aristotelian dictum that we are rational animals is under severe attack these days. In fact, the previous sentence may seriously understate the situation: the dictum is perhaps outright rejected by many, if not most. From psychologists of reasoning and decision-making to behavioral economists to the “new atheists” (all groups whose message we will consider in this class), the onslaught is firmly underway, and fierce",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Are Humans Rational?",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "info": "03/05/2021 10:10:24",
        "model": "database.course",
        "pk": 4057
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2120,
            "description": "This course is an introduction to the new and quickly growing field of cognitive science. Cognitive Science is a highly interdisciplinary field of study of mind at the intersection of philosophy, psychology, computer science, neuroscience, linguistics, and anthropology.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Cognitive Science",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "info": "03/05/2021 10:10:24",
        "model": "database.course",
        "pk": 4058
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4210,
            "description": "Recent advances in Cognitive Science, Computer Science and Mathematics, have resulted in the ability to develop computer programs that implement Probabilistic Cognitive Models (PCMs). The cognitive models that this course covers are based on approximate Bayesian Inference implemented by Markov Chain Monte Carlo and Variational techniques that have made this approach tractable. The objective of this course is to enable the student to develop models of cognition in a Bayesian framework.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Cognitive Modeling",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "info": "03/05/2021 10:10:24",
        "model": "database.course",
        "pk": 4059
    }
]